import matplotlib.pyplot as plt
import numpy as np

plt.rcParams['font.sans-serif'] = ['SimHei']
plt.rcParams['axes.unicode_minus'] = False

cutting = []
cutting2 = []
cutting3 = []
accuracy1 = []
accuracy2 = []
accuracy3 = []
# dict1 = {0.30:135.05834490687695, 0.39:127.60670652731449, 0.59:131.7018241099369, 0.79:170.62184015768793, 1.18:176.9904003959187,
#          1.89:319.3357757903856, 1.57:274.692291740533, 1.40:278.76625973415986, 0.47:139.10562085915566, 0.34:136.1118453418025
#          }

# dict1 = {0.30:135.05834490687695, 0.39:127.60670652731449, 0.59:145.7532899161034, 0.79:170.62184015768793, 1.18:176.9904003959187,
#          1.89:373.27659172037494, 1.57:274.692291740533, 1.40:278.76625973415986, 0.47:139.10562085915566, 0.34:136.1118453418025
#          }#0.59改不改？
# dict1 = {0.30:135.05834490687695, 0.39:127.60670652731449, 0.59:131.7018241099369, 0.79:170.62184015768793, 1.18:176.9904003959187}
# dict2 = {0.30:131.54831657950615, 0.39:124.89812481297437, 0.59:128.88248761652966, 0.79:163.8657953679099, 1.18:171.79222883394758}
# dict3 = {0.30:140.0489916190008, 0.39:131.07006642114163, 0.59:136.94336814975964, 0.79:179.01887247693534, 1.18:185.9948559704952}
#
# dict4 = {1.89:341.5961860613423, 1.40:233.915751092409}

dict1 = {0.30:135.0583449, 0.34:136.1118453, 0.39:127.6067065, 0.47:139.1056209, 0.59:145.7532899, 0.79:192.2989888, 1.18:176.9904061, 1.40:248.4895032, 1.57:318.2367828, 1.89:341.5961861}


dict2 = {0.3:131.5483166, 0.34:131.5338431, 0.79:170.6218402, 1.18:185.9948904, 1.40:278.7662597, 1.57:341.4678864, 1.89:373.2765917}

dict3 = {1.40:221.7008909, 1.57:274.6922917, 1.89:319.3357758}

list1 = [0.30, 0.34, 0.39, 0.47, 0.59, 0.79, 1.18, 1.40, 1.57, 1.89]
# list2 = [1.89, 1.40]
list2 = [0.3, 0.34, 0.79, 1.18, 1.40, 1.57, 1.89]
list3 = [1.40, 1.57, 1.89]
for i in list1:
    cutting.append(i)
    accuracy1.append(dict1[i])
    # accuracy3.append(dict1[i])

for i in list2:
    cutting2.append(i)
    accuracy2.append(dict2[i])

for i in list3:
    cutting3.append(i)
    accuracy3.append(dict3[i])


plt.xlim(0.2, 2.5)
plt.ylim(10, 5000)
plt.yscale('log')
plt.title('程序所得相变图')
plt.xlabel('κ', fontsize=20)
plt.ylabel('Γ', fontsize=20)
plt.xticks(fontsize=15)
plt.yticks(fontsize=15)
plt.scatter(cutting, accuracy1, marker='.', color='red', label="预测点")
plt.scatter(cutting2, accuracy2, marker='.', color='g', label="误差")
plt.scatter(cutting3, accuracy3, marker='.', color='b', label="误差")
# plt.scatter(cutting, accuracy2, marker='_', color='b', label="下限")
# plt.scatter(cutting, accuracy3, marker='_', color='purple', label="上限")
plt.show()